Demo-Java-Automation-api_SOAP/src/main/resources/xml/speedConverter/speedConverter.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.webserviceX.NET/">
   <soapenv:Header/>
   <soapenv:Body>
      <web:ConvertSpeed>
         <web:speed>?</web:speed>
         <web:FromUnit>?</web:FromUnit>
         <web:ToUnit>?</web:ToUnit>
      </web:ConvertSpeed>
   </soapenv:Body>
</soapenv:Envelope>