adapter/graveyard/request/message-speed.xml

<?xml version="1.0" encoding="UTF-8" ?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Body>
		<ConvertSpeed xmlns="http://www.webserviceX.NET/">
			<speed>100</speed>
			<FromUnit>milesPerhour</FromUnit>
			<ToUnit>kilometersPerhour</ToUnit>
		</ConvertSpeed>
	</soapenv:Body>
</soapenv:Envelope>